const holidays = [
    '1.1.2021',
    '2.1.2021',
    '3.1.2021',
    '4.1.2021',
    '5.1.2021',
    '6.1.2021',
    '7.1.2021',
    '8.1.2021',
    '23.2.2021',
    '8.3.2021',
    '1.5.2021',
    '9.5.2021',
    '12.6.2021',
    '4.11.2021',
];

const trips = {
    alekseyLechashchiy : {
        '1.6.2021': 'Екатеринбург',
        '2.6.2021': 'Екатеринбург',
        '4.6.2021': 'Москва',
        '7.6.2021': 'Москва',
        '17.6.2021': 'Санкт-Петербург',
        '18.6.2021': 'Санкт-Петербург',
        '28.6.2021': 'Сочи',
        '29.6.2021': 'Сочи',
        '30.6.2021': 'Сочи',
    },
    andreyKuznecov : {
        '1.6.2021': 'Москва',
        '7.6.2021': 'Пермь',
        '17.6.2021': 'Новосибирск',
        '18.6.2021': 'Новосибирск',
        '23.6.2021': 'Магадан',
        '29.6.2021': 'Казань'
    },
    мihailPopov : {
        '3.6.2021': 'Казань',
        '7.6.2021': 'Пермь',
        '17.6.2021': 'Москва',
        '28.6.2021': 'Екатеринбург',
        '29.6.2021': 'Екатеринбург',
    }
};

const workers = {
    alekseyLechashchiy: 'Алексей Лечащий',
    andreyKuznecov: 'Андрей Кузнецов',
    мihailPopov: 'Михаил Попов' 
};

const cityColor = {
    'Екатеринбург': '#0071B3',
    'Москва': '#59A646',
    'Санкт-Петербург': '#AF032C',
    'Сочи': '#DE911D',
    'Пермь': '#D86413',
    'Новосибирск': '#716613',
    'Магадан': '#29BFB8',
    'Казань': '#794355'
}

export {
    holidays,
    trips,
    workers,
    cityColor
};